STORY = {1: ['Отлучка', 'Вы остаётесь одни. Кто-то уезжает, отлучается, уходит. Для кого-то одиночество кажется тягостным, но не для вас. Напротив, в этом состоянии вы находите для себя новые возможности!'],
         2: ['Вредительство', 'Ваш враг делает первый шаг: вредит вам или члену вашей семьи, другу или соратнику. Какой будет ваша реакция? Что сделал этот подлец?'],
         3: ['Недостача', 'Вы понимаете, что вам недостаёт чего-то важного. Как, должно быть, вам хочется этим обладать, завоевать, заполучить! Что это - жених, невеста, драгоценность или способность? Решать вам.'],
         4: ['Запрет', 'Уходя, вам было запрещено. Строгий запрет, буквально табу. Не надо этого делать, нельзя. Будут последствия. Как же вы поступите? '],
         5: ['Нарушить запрет', 'Вы нарушаете запрет. Конечно, ваша бунтарская суть не позволит вам так просто игнорировать этот соблазн. А последствия... Да к чёрту их!'],
         6: ['Послушаться', 'Вы послушно следуете запрету: не суётесь, куда не стоит, делаете все по правилам. Меньше хлопот после. И вам спокойнее и проще жить!'],



         }